___

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" alt="CLRSWY"></p>

___

In [1]:
# Aggregation methods
"""
count(), min(), max(), std(), mean() ...
"""
import pandas as pd
import numpy as np
import seaborn as sns

df = pd.DataFrame()

In [2]:
df.mean

<bound method DataFrame.mean of Empty DataFrame
Columns: []
Index: []>

pd.<method>(df1, df2, ....)

In [150]:
pd.set_option('display.max_rows', 10)
pd.set_option('display.max_columns', 6)
pd.set_option('display.width', 1000)

In [8]:
#seaborn
#scikit-learn
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'exercise',
 'flights',
 'fmri',
 'gammas',
 'geyser',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'tips',
 'titanic']

In [9]:
import sklearn
from sklearn import datasets
[ _ for _ in dir(datasets) if _.startswith('load') or _.startswith('fetch')]

['fetch_20newsgroups',
 'fetch_20newsgroups_vectorized',
 'fetch_california_housing',
 'fetch_covtype',
 'fetch_kddcup99',
 'fetch_lfw_pairs',
 'fetch_lfw_people',
 'fetch_olivetti_faces',
 'fetch_openml',
 'fetch_rcv1',
 'fetch_species_distributions',
 'load_boston',
 'load_breast_cancer',
 'load_diabetes',
 'load_digits',
 'load_files',
 'load_iris',
 'load_linnerud',
 'load_sample_image',
 'load_sample_images',
 'load_svmlight_file',
 'load_svmlight_files',
 'load_wine']

In [10]:
df = sns.load_dataset('planets')

In [11]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [12]:
df['year'].mean()

2009.0705314009663

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [14]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [15]:
df.iloc[1:3].min()

method            Radial Velocity
number                          1
orbital_period              763.0
mass                         2.21
distance                    19.84
year                         2008
dtype: object

In [16]:
df.mass.min()

0.0036

In [17]:
df.mass.idxmin()

46

In [18]:
# import scipy    ##how to do mode?

In [19]:
from sklearn import datasets
[ _ for _ in dir(datasets) if _.startswith('load') or _.startswith('fetch')]

['fetch_20newsgroups',
 'fetch_20newsgroups_vectorized',
 'fetch_california_housing',
 'fetch_covtype',
 'fetch_kddcup99',
 'fetch_lfw_pairs',
 'fetch_lfw_people',
 'fetch_olivetti_faces',
 'fetch_openml',
 'fetch_rcv1',
 'fetch_species_distributions',
 'load_boston',
 'load_breast_cancer',
 'load_diabetes',
 'load_digits',
 'load_files',
 'load_iris',
 'load_linnerud',
 'load_sample_image',
 'load_sample_images',
 'load_svmlight_file',
 'load_svmlight_files',
 'load_wine']

In [20]:
df.iloc[df.mass.idxmin()].year

2012

In [21]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

df.describe(percentiles=[p/100 for p in range(0, 101, 10)])

In [22]:
# [ <thing in the list>  <for statement>   <logic filter            ]
[ x / 100    for x in ( 1, 2, 4)  ]

[0.01, 0.02, 0.04]

In [23]:
des = df.describe()
des

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

type(des)

In [24]:
type(des)

pandas.core.frame.DataFrame

In [25]:
des.T #.transpose

                 count         mean           std          min         25%        50%       75%       max
number          1035.0     1.785507      1.240976     1.000000     1.00000     1.0000     2.000       7.0
orbital_period   992.0  2002.917596  26014.728304     0.090706     5.44254    39.9795   526.005  730000.0
mass             513.0     2.638161      3.818617     0.003600     0.22900     1.2600     3.040      25.0
distance         808.0   264.069282    733.116493     1.350000    32.56000    55.2500   178.500    8500.0
year            1035.0  2009.070531      3.972567  1989.000000  2007.00000  2010.0000  2012.000    2014.0

In [26]:
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [27]:
df.dropna()

              method  number  orbital_period    mass  distance  year
0    Radial Velocity       1       269.30000   7.100     77.40  2006
1    Radial Velocity       1       874.77400   2.210     56.95  2008
2    Radial Velocity       1       763.00000   2.600     19.84  2011
3    Radial Velocity       1       326.03000  19.400    110.62  2007
4    Radial Velocity       1       516.22000  10.500    119.47  2009
..               ...     ...             ...     ...       ...   ...
640  Radial Velocity       1       111.70000   2.100     14.90  2009
641  Radial Velocity       1         5.05050   1.068     44.46  2013
642  Radial Velocity       1       311.28800   1.940     17.24  1999
649          Transit       1         2.70339   1.470    178.00  2013
784  Radial Velocity       3       580.00000   0.947    135.00  2012

[498 rows x 6 columns]

In [33]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [34]:
df.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [35]:
df.corr(method='pearson')  #spearman   kendall

                  number  orbital_period      mass  distance      year
number          1.000000       -0.012570 -0.241429 -0.033638  0.147849
orbital_period -0.012570        1.000000  0.173725 -0.034365 -0.032333
mass           -0.241429        0.173725  1.000000  0.274082 -0.123787
distance       -0.033638       -0.034365  0.274082  1.000000  0.178922
year            0.147849       -0.032333 -0.123787  0.178922  1.000000

In [36]:
import scipy
from scipy import stats
from scipy.stats import mode

mode(df.values)

In [37]:
print("hey")

hey

In [38]:
df[['mass', 'distance', 'orbital_period']].corr(method='spearman')

                    mass  distance  orbital_period
mass            1.000000  0.467621        0.542234
distance        0.467621  1.000000       -0.373384
orbital_period  0.542234 -0.373384        1.000000

In [39]:
df['method'].value_counts()

Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: method, dtype: int64

In [40]:
df.groupby('method')

In [41]:
df.groupby('method')['orbital_period']

In [42]:
df.groupby('method')[['orbital_period']]

In [43]:
df.groupby('method')['orbital_period'].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [44]:
df.groupby('method')['orbital_period'].describe()

                               count           mean            std          min          25%           50%           75%            max
method
Astrometry                       2.0     631.180000     544.217663   246.360000   438.770000    631.180000    823.590000    1016.000000
Eclipse Timing Variations        9.0    4751.644444    2499.130945  1916.250000  2900.000000   4343.500000   5767.000000   10220.000000
Imaging                         12.0  118247.737500  213978.177277  4639.150000  8343.900000  27500.000000  94250.000000  730000.000000
Microlensing                     7.0    3153.571429    1113.166333  1825.000000  2375.000000   3300.000000   3550.000000    5100.000000
Orbital Brightness Modulation    3.0       0.709307       0.725493     0.240104     0.291496      0.342887      0.943908       1.544929
Pulsar Timing                    5.0    7343.021201   16313.265573     0.090706    25.262000     66.541900     98.211400   36525.000000
Pulsation Timing Variations      1.0    1170.000000            NaN  1170.000000  1170.000000   1170.000000   1170.000000    1170.000000
Radial Velocity                553.0     823.354680    1454.926210     0.736540    38.021000    360.200000    982.000000   17337.500000
Transit                        397.0      21.102073      46.185893     0.355000     3.160630      5.714932     16.145700     331.600590
Transit Timing Variations        3.0      79.783500      71.599884    22.339500    39.675250     57.011000    108.505500     160.000000

In [49]:
df.groupby('method')[['distance']].count()  # stdev, max, min
#<obj>.groupby(<column to agg>) <col to report>.<agg method>

                               distance
method
Astrometry                            2
Eclipse Timing Variations             4
Imaging                              32
Microlensing                         10
Orbital Brightness Modulation         2
Pulsar Timing                         1
Pulsation Timing Variations           0
Radial Velocity                     530
Transit                             224
Transit Timing Variations             3

In [46]:
df.year.value_counts()

2011    185
2012    140
2013    118
2010    102
2009     98
       ...
1992      2
1997      1
1995      1
1994      1
1989      1
Name: year, Length: 23, dtype: int64

In [51]:
data = {'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
       'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales':[200, 120, 340, 124, 243, 350]}

In [ ]:
df1 = pd.DataFrame(data)
df1

In [54]:
bycomp = df1.groupby('Company')

In [55]:
bycomp.median()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [56]:
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [58]:
bycomp.std()  #max, count, etc. (built-in)

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [59]:
bycomp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [61]:
bycomp.describe().transpose() #T

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [62]:
bycomp.describe().T['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [ ]:
# aggregate, filter, transform, apply

df6 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1':    [10,23,33,22,11,99],
                   'var2':    [100,253,333,262,111,969]})
df6

In [64]:
df6

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [69]:
df6.groupby('groups').mean()

        var1  var2
groups
A         16   181
B         17   182
C         66   651

In [70]:
df6.groupby('groups')

In [71]:
df6.groupby('groups').aggregate( [ np.min, np.median, np.max ] )

       var1             var2
       amin median amax amin median amax
groups
A        10     16   22  100    181  262
B        11     17   23  111    182  253
C        33     66   99  333    651  969

In [72]:
df6.groupby('groups').aggregate([ min, 'median', max  ])

       var1            var2
        min median max  min median  max
groups
A        10     16  22  100    181  262
B        11     17  23  111    182  253
C        33     66  99  333    651  969

In [74]:
df6.groupby('groups').agg({ 'var1': ('min', max), 'var2': 'median' })

       var1       var2
        min max median
groups
A        10  22    181
B        11  23    182
C        33  99    651

In [75]:
df7 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})

In [76]:
df7

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [77]:
df7.groups.unique()

array(['A', 'B', 'C'], dtype=object)

In [79]:
df7['var1'] > 15 # < == >=     &  |

0    False
1     True
2     True
3     True
4    False
5     True
Name: var1, dtype: bool

In [83]:
df7.groupby('groups').filter(lambda a: True  )   #some callable

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [86]:
def filter_funct(x):
    return x['var1'].mean() > 19

In [88]:
df7.groupby('groups').filter(filter_funct )

  groups  var1  var2
2      C    33   333
5      C    99   969

In [89]:
df7.groupby("groups").sum()

        var1  var2
groups
A         32   362
B         34   364
C        132  1302

In [92]:
df8 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df8

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [94]:
df8['var1'] * 9

0     90
1    207
2    297
3    198
4     99
5    891
Name: var1, dtype: int64

In [95]:
df_a  = df8.iloc[:, 1:3]
df_a

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

In [96]:
df_a.transform ( lambda x: ( x - x.mean()) / x.std() )   #callable function

       var1      var2
0 -0.687871 -0.738461
1 -0.299074 -0.263736
2  0.000000 -0.015514
3 -0.328982 -0.235811
4 -0.657963 -0.704331
5  1.973890  1.957853

In [97]:
zvals = df_a.transform ( lambda x: ( x - x.mean()) / x.std() )

In [99]:
zvals.rename(  { c: c + '_z' for c in  zvals.columns }, axis=1, inplace=True     )

In [100]:
zvals

     var1_z    var2_z
0 -0.687871 -0.738461
1 -0.299074 -0.263736
2  0.000000 -0.015514
3 -0.328982 -0.235811
4 -0.657963 -0.704331
5  1.973890  1.957853

In [102]:
pd.concat( [df_a , zvals], axis=1   )

   var1  var2    var1_z    var2_z
0    10   100 -0.687871 -0.738461
1    23   253 -0.299074 -0.263736
2    33   333  0.000000 -0.015514
3    22   262 -0.328982 -0.235811
4    11   111 -0.657963 -0.704331
5    99   969  1.973890  1.957853

In [103]:
np.log( df_a.var1)

0    2.302585
1    3.135494
2    3.496508
3    3.091042
4    2.397895
5    4.595120
Name: var1, dtype: float64

In [104]:
df9 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99],
                   'var2': [100,253,333,262,111,969]})
df9

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969

In [105]:
#sum    df.sum    'sum'  np.sum   my_sum()
df9.apply( np.sum  )

groups    ABCABC
var1         198
var2        2028
dtype: object

In [106]:
type(df9.apply( np.sum  ))

pandas.core.series.Series

In [107]:
df_numeric = df9.iloc[:, 1:3]
df_numeric

   var1  var2
0    10   100
1    23   253
2    33   333
3    22   262
4    11   111
5    99   969

df_numeric.apply(np.mean)

In [110]:
df_numeric.apply(np.mean, axis=0)

var1     33.0
var2    338.0
dtype: float64

In [111]:
df9.groupby('groups').

In [112]:
df9.groupby('groups').apply(np.mean)

        var1   var2
groups
A       16.0  181.0
B       17.0  182.0
C       66.0  651.0

In [113]:
df9.groupby('groups').mean()

        var1  var2
groups
A         16   181
B         17   182
C         66   651

In [114]:
df10 = pd.DataFrame({'col1':[1,2,3,4],
                     'col2':[444,555,666,444],
                     'col3':['abc','def','ghi','xyzeeee']})

df10

   col1  col2     col3
0     1   444      abc
1     2   555      def
2     3   666      ghi
3     4   444  xyzeeee

In [115]:
def squared(x):
    return x**2

In [116]:
df10['col1'].apply(squared)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [118]:
df10['col3'].apply(len)

0    3
1    3
2    3
3    7
Name: col3, dtype: int64

In [119]:
df11 = df10.iloc[:, :2]

In [120]:
df11

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [121]:
df11.applymap(lambda x: x*5)

   col1  col2
0     5  2220
1    10  2775
2    15  3330
3    20  2220

In [123]:
def double_odd(x):
    if x % 2:
        return x * 2
    else:
        return np.nan

df11.applymap(double_odd)

   col1    col2
0   2.0     NaN
1   NaN  1110.0
2   6.0     NaN
3   NaN     NaN

In [124]:
df11.col1

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [125]:
df11.col1.map( {2 : 'two' , 4: 'four'  }   )

0     NaN
1     two
2     NaN
3    four
Name: col1, dtype: object

In [126]:
df10

   col1  col2     col3
0     1   444      abc
1     2   555      def
2     3   666      ghi
3     4   444  xyzeeee

In [127]:
df10['col3'].transform(len)

0    3
1    3
2    3
3    7
Name: col3, dtype: int64

In [128]:
df1 = pd.DataFrame([["a", 9, 25]] * 4, columns=["grp", 'P', 'Q'])
df2 = pd.DataFrame([["b", 9, 25]] * 3, columns=["grp", 'P', 'Q'])

In [129]:
df1

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25

In [130]:
df2

  grp  P   Q
0   b  9  25
1   b  9  25
2   b  9  25

In [133]:

pd.concat( [ df1, df2   ] , ignore_index=True  )

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [134]:
pd.concat( [ df1, df2   ] , ignore_index=True  )

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
4   b  9  25
5   b  9  25
6   b  9  25

In [139]:
a = pd.concat( [ df1, df2   ] ,   )
a

  grp  P   Q
0   a  9  25
1   a  9  25
2   a  9  25
3   a  9  25
0   b  9  25
1   b  9  25
2   b  9  25

In [138]:
a.loc[0,:]

  grp  P   Q
0   a  9  25
0   b  9  25

In [140]:
def squared(x,y):    
    return (x**2,y**2) # a tuple of (x^2, y^2)

In [144]:
df3 = pd.concat([df1, df2], ignore_index=True)
df3['R'] = df3[['P','Q']].apply(lambda df3: squared(df3['P'],df3['Q']),axis=1)

#df3['R'] = df3[[ 'P', 'Q' ]].apply( lambda df3: squared(df3['P', df3['Q']], axis=1))

In [145]:
df3

  grp  P   Q          R
0   a  9  25  (81, 625)
1   a  9  25  (81, 625)
2   a  9  25  (81, 625)
3   a  9  25  (81, 625)
4   b  9  25  (81, 625)
5   b  9  25  (81, 625)
6   b  9  25  (81, 625)

In [146]:
titanic = sns.load_dataset('titanic')

In [147]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked   class    who  adult_male deck  embark_town alive  alone
0           0       3    male  22.0      1      0   7.2500        S   Third    man        True  NaN  Southampton    no  False
1           1       1  female  38.0      1      0  71.2833        C   First  woman       False    C    Cherbourg   yes  False
2           1       3  female  26.0      0      0   7.9250        S   Third  woman       False  NaN  Southampton   yes   True
3           1       1  female  35.0      1      0  53.1000        S   First  woman       False    C  Southampton   yes  False
4           0       3    male  35.0      0      0   8.0500        S   Third    man        True  NaN  Southampton    no   True
..        ...     ...     ...   ...    ...    ...      ...      ...     ...    ...         ...  ...          ...   ...    ...
886         0       2    male  27.0      0      0  13.0000        S  Second    man        True  NaN  Southampton    no   True
887         1       1  female  19.0      0      0  30.0000        S   First  woman       False    B  Southampton   yes   True
888         0       3  female   NaN      1      2  23.4500        S   Third  woman       False  NaN  Southampton    no  False
889         1       1    male  26.0      0      0  30.0000        C   First    man        True    C    Cherbourg   yes   True
890         0       3    male  32.0      0      0   7.7500        Q   Third    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

In [148]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare', 'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town', 'alive', 'alone'], dtype='object')

In [152]:
titanic.head()

   survived  pclass     sex  ...  embark_town  alive  alone
0         0       3    male  ...  Southampton     no  False
1         1       1  female  ...    Cherbourg    yes  False
2         1       3  female  ...  Southampton    yes   True
3         1       1  female  ...  Southampton    yes  False
4         0       3    male  ...  Southampton     no   True

[5 rows x 15 columns]

In [154]:
titanic.groupby(['sex', 'class']) ['survived'].mean()

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [155]:
titanic.pivot_table( 'survived',index='sex', columns='class'    )

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [157]:
titanic.pivot_table( 'survived',index=['sex', 'age'], columns='class'    )
titanic['bin'] = pd.cut(titanic.age, [0,30,60,90])
titanic.pivot_table( 'survived',index=['sex', 'bin'], columns='class'    )

class               First    Second     Third
sex    bin
female (0, 30]   0.942857  0.931818  0.506329
       (30, 60]  0.979167  0.900000  0.272727
       (60, 90]  1.000000       NaN  1.000000
male   (0, 30]   0.500000  0.192308  0.167630
       (30, 60]  0.412698  0.090909  0.118421
       (60, 90]  0.083333  0.333333  0.000000

In [158]:
data = {'A':['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
       'B':['one', 'one', 'two', 'two', 'one', 'one'],
       'C':['x', 'y', 'x', 'y', 'x', 'y'],
       'D':[1, 3, 2, 5, 4, 1]}

df5 = pd.DataFrame(data)

df5

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [159]:
df5.groupby(["A","B",'C'])[["D"]].aggregate("mean").stack()

A    B    C
bar  one  x  D    4
          y  D    1
     two  y  D    5
foo  one  x  D    1
          y  D    3
     two  x  D    2
dtype: int64

In [161]:
df5.groupby(["A","B",'C'])[["D"]].aggregate("mean").unstack()

           D
C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN